presentations/week2.tex
% Created 2021-02-03 Wed 21:54
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Karl Statz}
\date{\today}
\title{C++ Week 2}
\hypersetup{
 pdfauthor={Karl Statz},
 pdftitle={C++ Week 2},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 27.1 (Org mode 9.5)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Variables}
\label{sec:org7506b7e}
\begin{verbatim}
int x = 10;
long z = 1000000;
double y = 1.1111111;
float f = 1.11;
\end{verbatim}
\section{functions}
\label{sec:orgb32b84b}
\begin{verbatim}
// function that returns nothing and takes in no arguments
void foo();

// function that returns something
int foo();

// overloaded function
int foo(int x);

// overloaded foo with a default argument
int foo(int x, int y = 10);
\end{verbatim}
\section{collections}
\label{sec:orge308cc3}
\begin{verbatim}
//arrays
//fixed sized collection
int x[10] = {1, 2, 3, 4, 5, 6, 7, 8, 9, 10};

//vector (make sure you include <vector>)
//a variable sized, indexed collection
std::vector<int> myInts = std::vector<int>();
\end{verbatim}
\section{Local Development}
\label{sec:org5bbf6dc}
\subsection{CMake}
\label{sec:orga5e561b}
Cmake is a build system for building c/c++ projects. It's primary job is to generate the appropriate make file for a certain project. I chose it because, unlike vanilla make, it has easy to remember syntax and is generally human readable.
\subsubsection{Best Practices}
\label{sec:orgc8d740c}
\begin{enumerate}
\item create a build/ directory adjacent to your src/ directory. This keeps any build cruft contained and easy to delete
\label{sec:orgb3f5924}
\item run all cmake commands from the build/ directory. running cmake ../ runs the command in the parent directory
\label{sec:org28eb253}
\item add the build/ directory to your .gitignore so build artefacts arent committed.
\label{sec:org78158eb}
\item after you run cmake and generate the build scripts, you compile your code with running `make` in the build directory
\label{sec:org0a66eeb}
\end{enumerate}
\end{document}
